app_demo/app/controllers/carts_controller.rb

  def show
    @cart = Cart.find(params[:id])
---
SELECT `carts`.* FROM `carts` WHERE `carts`.`id` = 3 LIMIT 1

  def edit
    @cart = Cart.find(params[:id])
---
SELECT `carts`.* FROM `carts` WHERE `carts`.`id` = 3 LIMIT 1

  def destroy
    @cart = current_cart
    @cart.destroy
---
DELETE FROM `carts` WHERE `carts`.`id` = 3