app_demo/app/controllers/line_items_controller.rb

SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
INSERT INTO `carts` (`created_at`, `updated_at`) VALUES ('2013-11-30 06:17:14', '2013-11-30 06:17:14')
INSERT INTO `line_items` (`cart_id`, `created_at`, `order_id`, `product_id`, `quantity`, `updated_at`) VALUES (18, '2013-12-02 06:30:16', NULL, 3, 1, '2013-12-02 06:30:16')
UPDATE `line_items` SET `quantity` = 2, `updated_at` = '2013-11-30 08:07:57' WHERE `line_items`.`id` = 3
---
  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save