app_demo/app/controllers/orders_controller.rb

SELECT COUNT(*) FROM `orders`
SELECT `orders`.* FROM `orders` ORDER BY created_at desc LIMIT 10 OFFSET 0
---
  def index
    @orders = Order.paginate page: params[:page], order: 'created_at desc',per_page: 10

SELECT COUNT(*) FROM `line_items` WHERE `line_items`.`cart_id` = 17
SELECT `line_items`.* FROM `line_items` WHERE `line_items`.`cart_id` = 17
---
  def new
    @cart = current_cart
    if @cart.line_items.empty?

INSERT INTO `orders` (`address`, `created_at`, `email`, `name`, `pay_type`, `updated_at`) VALUES ('asd', '2013-12-02 06:29:48', 'gongwenwei@gmail.com', 'asd', 'Check', '2013-12-02 06:29:48')
DELETE FROM `carts` WHERE `carts`.`id` = 17
---
  def create
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(current_cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])