app_demo/app/controllers/users_controller.rb

SELECT `users`.* FROM `users` ORDER BY name
---
  def index
    @users = User.order(:name)

INSERT INTO `users` (`created_at`, `name`, `password_digest`, `updated_at`) VALUES ('2013-12-02 08:38:41', 'admin', '$2a$10$GTVS7DfD3OFnmMuTjAtP5uZge95umyTnhw3shpJ1UeyoeDUcCEpOa', '2013-12-02 08:38:41')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save